; WinSnap v2.0.3
; ENG: Finnish Language File / FIN: Suomenkielen käännöstiedosto
; ENG: Translated by / FIN: Kääntänyt Oskari Lavinto <http://www.olavinto.net/, oskari.lavinto@gmail.com>

10000="Finnish (Suomi)"

; Cofiguration
20000="Windows Snapshot Maker v1.1.6"
20001=" (Rekisteröimätön)"

; Tooltip for tray icon
20002="WinSnap"
20003="WinSnap v2.0"

; Default name of saved image
20010="kuvankaappaus"

; Print job name
20011="WinSnap kuvankaappaus"

; Save/Open filters
20030="Kaikki tiedostot (*.*)"
20031="Kaikki tuetut tiedostotyypit"
20032="Lisenssitiedosto (*.key, *.txt)"
20033="Sovellustiedostot (*.exe, *.bat, *.cmd)"
20040="BMP (*.bmp, *.dib)"
20041="JPEG (*.jpg, *.jpeg, *.jpe)"
20042="PNG (*.png)"
20043="GIF (*.gif)"
20044="TIFF (*.tif, *.tiff)"

; Save As dialog
20060="Tallenna läpikuultavuus"

; Settings, Image tab
20061="Läpikuultavuus"

; Supported formats
20062="BMP"
20063="JPEG"
20064="PNG"
20065="GIF"
20066="TIFF"

; Preview states
20090="<< Ei kaapattua kuvaa >>"
20091="Luodaan esikatselua..."

; Main window
20100="Sulje"
20101="Kaappaa uusi kuva"
20102="Kopioi kuva leikepöydälle"
20103="Tallenna kuva nimellä..."
20104="Lähetä s-postin liitteenä..."

20110="Värit:"
20111="Ei mitään"
20112="Harmaasävy"
20113="Seepia"
20114="Käänteinen"

20115="Varjo:"
20116="Ei mitään"
20117="Positiivinen"
20118="Negatiivinen"
20119="Reunaviiva"

20120="Sekalaiset:"
20121="Ääriviiva"
20122="Vesileima"
20123="Kääntö"
20124="Skaalaus"

20200="Kaappauksen tila:"
20201="Koko näyttö"
20202="Sovellus"
20203="Ikkuna"
20204="Ikkunan sisältö"
20205="Ponnahdusvalikko"
20206="Valinnainen alue"

; Capture modes
20211="Koko näyttö"
20212="Sovellus"
20213="Ikkuna"
20214="Valikko"
20215="Objekti"
20216="Alue"

; Menu
20300="Tiedosto"
20301="Kaappaa uusi kuva\tCtrl+N"
20302="Avaa kuvatiedosto...\tCtrl+O"
20303="Tallenna\tCtrl+S"
20304="Tallenna nimellä..."
20305="Tallenna miniatyyrikuva nimellä..."
20306="Tulosta...\tCtrl+P"
20307="Sivun a&setukset..."
20308="Sulje"

20350="Muokkaa"
20351="Kopioi\tCtrl+C"
20352="Kopioi miniatyyrikuva"
20353="Liitä\tCtrl+V"
20354="Tyhjennä kuva\tDel"

20400="Asetukset"
20401="Automaattinen tallennus"
20402="Automaattinen kopiointi"
20403="Asetukset...\tF2"

20410="Värit"
20411="Ei mitään"
20412="Harmaasävy"
20413="Seepia"
20414="Käänteinen"

20420="Varjo"
20421="Ei mitään"
20422="Positiivinen"
20423="Negatiivinen"
20424="Reunaviiva"

20430="Sekalaiset"
20431="Ääriviiva"
20432="Vesileima"
20433="Kääntö"
20434="Skaalaus"

20500="Kaappaa kuva"
20501="Koko näyttö\tCtrl+1"
20502="Sovellus\tCtrl+2"
20503="Ikkuna\tCtrl+3"
20504="Ikkunan sisältö\tCtrl+4"
20505="Ponnahdusvalikko\tCtrl+5"
20506="Valinnainen alue...\tCtrl+6"

; Main menu, Capture
20511="Koko näyttö\tCtrl+1"
20512="Sovellus\tCtrl+2"
20513="Ikkuna\tCtrl+3"
20514="Valikko\tCtrl+4"
20515="Objekti\tCtrl+5"
20516="Alue\tCtrl+6"

20550="Ohje"
20551="Ohjeen aiheet\tF1"
20552="Kotisivut"
20553="Virallinen keskustelualue"
20554="Tarkista päivitykset nyt"
20555="Tietoja ohjelmasta..."
20556="Rekisteröi WinSnap"
20557="Syötä lisenssikoodi..."

; Main menu
20600="Työkalut"
20601="Mukauta..."

; Tray menu
20900="Piilota WinSnap"
20901="Näytä WinSnap"
20903="Asetukset..."
20904="Sulje"

20911="Koko näyttö"
20912="Sovellus"
20913="Ikkuna"
20914="Ikkunan sisältö"
20915="Ponnahdusvalikko"
20916="Valinnainen alue"

; Tray menu
20921="Koko näyttö"
20922="Sovellus"
20923="Ikkuna"
20924="Valikko"
20925="Objekti"
20926="Alue"

; Config
21000="Asetukset"
21001="OK"
21002="Peruuta"
21003="Käytä"

21050="Yleiset"
21051="Sekoitus"
21052="Kehys"
21053="Vesileima"
21054="Kuva"
21055="Pikänäppäimet"

; General page
21100="Kieli:"
21101="Hae lisää käännöksiä..."
21102="Käynnistä WinSnap Windowsin käynnistyksen yhteydessä"
21103="Tarkista ohjelmapäivitykset automaatisesti internetistä"
21104="Näytä ikkuna aina päällimmäisenä"
21105="Palauta ikkunan koko ja sijainti"
21106="Näytä WinSnap aina tehtäväpalkin tarjottimella"
21107="Pienenneä tehtäväpalkin tarjottimelle kun ikkuna suljetaan"
21108="Kaappaa kuva kun WinSnap avataan:"
21109="Kaappauksen tila:"
21110="Soita ääni kun kuva kaapataan"
21111="Piilota WinSnap ennen kuvankaappausta"
21112="Piilota tehtäväpalkin tarjottimen kuvake ennen kuvankaappausta"
21113="Viive ennen kaappausta, jos ikkunoita on auki (ms):"
21114="Näytä hiiren osoitin kaapatussa kuvassa"

; Blending page
21200="Varjo:"
21201="Kulma:"
21202="°"
21203="Etäisyys:"
21204="px"
21205="Koko:"
21206="px"
21207="Läpikuultavuus:"
21208="%"
21209="Väri:"
21210="#"
21211="Ääriviiva:"
21212="Väri:"
21213="#"
21214="Koko:"
21215="px"
21216="Tausta:"
21217="Väri:"
21218="#"

; Canvas page
21400="Kääntö:"
21401="Kulma:"
21402="°"
21403="Skaalaus:"
21404="Määritä prosentteina:"
21405="Määritä kuvapisteinä:"
21406="Mittasuhde:"
21407="%"
21408="Levys:"
21409="px"
21410="Korkeus:"
21411="px"
21412="Säilytä mittasuhteet"
21413="Kehittyneet asetukset:"
21414="interpolointi:"

21490="Nearest neighbor"
21491="Bilinear"
21492="Bicubic"
21493="High-Quality Bilinear"
21494="High-Quality Bicubic"

; Watermark page
21500="Peittokuva:"
21501="Kuvatiedosto:"
21502="Selaa..."
21503="Peittokuvan läpikuultavuus:"
21504="Lapikuultavuus:"
21505="%"
21506="Sijainti:"
21507="Määritä leiman sijainti kuvan rinnakkaisilta laidoilta:"
21508="Vaakasuora:"
21509="%"
21510="Pystysora:"
21511="%"
21512="Vaakasuora:"
21513="px"
21514="Pystysuora:"
21515="px"
21516="Käytä suhteellisia koordinaatteja"

21590="Ylävasemmalla"
21591="Ylhäällä, keskellä"
21592="Yläoikealla"
21593="Keskellä, vasemmalla"
21594="Keskitetty"
21595="Keskellä, oikealla"
21596="Alavasemmalla"
21597="Alhaalla, keskellä"
21598="Alaoikealla"

; Saving page
21600="Kopioi kuvat leikepöydälle automaattisesti"
21601="Tallenna kuvat levylle automaattisesti"
21602="Älä kysy tiedostonimeä kuvaa tallennettaessa"
21610="Automaattitallennuksen asetukset:"
21611="Oletushakemisto:"
21612="Selaa..."
21613="Tiedostonimi:"
21615="Tiedostotyyppi:"
21620="Pakkaus:"
21621="JPEG-laatu:"
21622="%"
21699="Valitse hakemisto, johon haluat automaattitallennuksen tallentavan kaapatut kuvat."
21603="Pidä WinSnap pienennettynä kun automaattitallennus on käytössä"
21604="Poista kaapattu kuva muistin säästämiseksi kun ikkuna pienennetään"

; Hotkeys page
21700="Käytä pikanäppäimiä myös muiden sovellusten ollessa aktiivisia"
21701="Kuvankaappauksen hallinta:"
21702="Koko näyttö:"
21703="Aktiivisen sovelluksen ikkunat:"
21704="Aktiivinen ikkuna:"
21705="Ikkunan sisältö:"
21706="Ponnahdusvalikko:"
21707="Kaappaa valinnainen alue:"
21712="Koko näyttö:"
21713="Sovellusikkuna:"
21714="Aktiivinen ikkuna:"
21715="Ponnahdusvalikko:"
21716="Aloita objektin kaappaus:"
21717="Aloita alueen kaappaus:"
21720="Ohjelman hallinta:"
21721="Pienennä/palauta:"
21722="Näytä/piilota pääikkuna:"
21723="Sulje WinSnap:"

; Customize Tools dialog
23000="Mukauta työkaluja"
23001="Uusi..."
23002="Muokkaa..."
23003="Poista"
23004="Siirrä ylös"
23005="Siirrä alas"
23006="Sulje"

; New Tool dialog
23100="Ulkoinen työkalu"
23101="OK"
23102="Peruuta"
23110="Sovellus:"
23111="Nimi:"
23112="Komento:"
23113="Selaa..."
23114="Parametrit:"
23115="Pienennä WinSnap kun komento suoritetaan"
23116="Älä kysy tiedostonimeä kun kuvaa tallennetaan"
23120="Tallennusasetukset:"
23121="Hakemisto:"
23122="Selaa..."
23123="Tiedostonimi:"
23124="Tiedostotyyppi:"

; Region selection
24001="Nuolinäppäimet/hiiri: valitse kaapattava alue\r\nHiiren oikea painike: muuta alueen muotoa\r\nF1: näytä/piilota tämä avustaja"
24002="Sijainti:"
24003="x:"
24004="y:"
24005="Koko:"
24006="w:"
24007="h:"
24100="Neliö"
24101="Pyöristetty neliö"
24102="Soikio"
24103="Peruuta valinta\tBackspace"
24104="Peruuta kaappaus\tEsc"
24105="Sulje tämä valikko"

; Region mode, right-click menu
24106="Lukittu koko"
24107="Säilytä sijainti"

; Object mode, helper dialog
24201="Liikuta hiiren osoitinta vaihtaaksesi kohdetta. Käytä Ctrl-näppäintä valitaksesi useampia objekteja ja hiiren oikeaa painiketta vaihtaaksesi asetuksia."
24202="Otsikko:"
24203="Luokka:"
24204="Prosessi:"

; Object mode, right-click menu
24300="Valitse objekti\tSpace"
24301="Käänteinen valinta\tTab"
24302="Poista valinnat\tBackspace"
24303="Painikkeet ja kontrollit"
24304="Sovellusikkunat"
24305="Peruuta kaappaus\tEsc"
24306="Sulje tämä valikko"

; Register dialog
28000="Rekisteröi WinSnap"
28001="Tilaa nyt!"
28002="Syötä lisenssiavain..."
28003="Jatka"
28004="Poistu"
28010="WinSnap versiosi on 30-päivän kokeiluversio. Sinun on ostettava lisenssi, jos haluat jatkaa sen käyttöä."
28011="Sinulla on %d-päivää aikaa rekisteröidä WinSnap."
28012="Lisenssit ja hinnat"

; About dialog
28100="Tietoja ohjelmasta"
28101="OK"
28102="Rekisteröi"
28103="Tämän tuotteen käyttöoikeuden omistaa:"
28104="Tukifoorumi"

; Confirmations
31900="WinSnap-vahvistus"
31901="WinSnap on jo avoinna. Haluatko sulkea sen?"
31902="Oletko varma, että haluat sulkea WinSnapin?"
31903="Ole hyvä ja käynnistä WinSnap uudelleen päättääksesi rekisteröintiprosessin.\r\nHaluatko käynnistäää WinSnapin uudelleen nyt?"

; Errors
32000="WinSnap-virhe"
32001="Käännöstiedoston lataus ei onnistunut."
32002="Asetusten tallennus rekisteriin ei onnistunut. Tarkista hallintaoikeutesi."
32003="Kuvatiedoston avaus ei onnistunut.\r\nTämä ei ole kelpaava kuvatiedosto tai WinSnap ei vielä tue sen tyyppiä."
32004="Kuvatiedoston tallennus ei onnistunut."
32005="Väliaikaistiedoston lunti ei onnistunut."
32006="Sähköpostijärjestelmän tuen lataus ei onnistunut (Mapi32.dll)."
32007="MAPI ei voinut lähettää viestiä."
32008="WinSnapin rekisteröinti epäonnistui."
32009="Virheellinen hakemisto:\r\n%s"
32010="Prosessin luonti ei onnistunut."
32020="Sinun tulisi määrittää nimi."

; Check for update
32500="WinSnapin päivitys"
32501="Uusi versio WinSnapista on saatavilla!\r\nHaluatko ladata sen nyt?"
32502="WinSnap-versiosi on ajan tasalla. Uutta versiota ei ole saatavilla."
